# 1. market.csv 파일 업로드

In [1]:
import csv

In [2]:
f = open('market.csv','r') # open 함수로 f(file handler)에 저장
reader = csv.reader(f) # reader() 함수의 인수로 넣어 reader라는 객체를 생성

# 2. CSV모듈 임포트

In [3]:
f = open('market.csv','r') # open 함수로 f(file handler)에 저장
reader = csv.reader(f) # reader() 함수의 인수로 넣어 reader라는 객체를 생성

for row in reader:
    print(row) # 문자열 리스트로 출력

['id', 'name', 'price', 'amount']
['1', 'apple', '5000', '5']
['2', 'pencil', '500', '24']
['3', 'pineapple', '8000', '5']
['4', 'pen', '1500', '10']
['5', 'mango', '3000', '15']

# 3. 데이터프레임으로 저장

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('market.csv') # df(dataframe)에 저장

In [6]:
df

   id       name  price  amount
0   1      apple   5000       5
1   2     pencil    500      24
2   3  pineapple   8000       5
3   4        pen   1500      10
4   5      mango   3000      15

In [7]:
type(df)

pandas.core.frame.DataFrame

# 4. dataframe 정보 확인

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
id        5 non-null int64
name      5 non-null object
price     5 non-null int64
amount    5 non-null int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [9]:
len(df) # 데이터 개수 확인

5

In [10]:
df.isnull().sum() # 결측치 개수 확인

id        0
name      0
price     0
amount    0
dtype: int64

In [11]:
df.isnull()

      id   name  price  amount
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False

In [12]:
df.describe() # 요약값

             id        price     amount
count  5.000000     5.000000   5.000000
mean   3.000000  3600.000000  11.800000
std    1.581139  2987.473849   7.981228
min    1.000000   500.000000   5.000000
25%    2.000000  1500.000000   5.000000
50%    3.000000  3000.000000  10.000000
75%    4.000000  5000.000000  15.000000
max    5.000000  8000.000000  24.000000

In [13]:
df1 = df.drop(['id'],axis =1 )

In [14]:
df1

        name  price  amount
0      apple   5000       5
1     pencil    500      24
2  pineapple   8000       5
3        pen   1500      10
4      mango   3000      15

In [15]:
df1.describe()

             price     amount
count     5.000000   5.000000
mean   3600.000000  11.800000
std    2987.473849   7.981228
min     500.000000   5.000000
25%    1500.000000   5.000000
50%    3000.000000  10.000000
75%    5000.000000  15.000000
max    8000.000000  24.000000

In [16]:
df1.to_csv('market2.csv') # csv 파일로 저장

# 5. 리스트형태로 데이터프레임 만들기

### 리스트(list) : 가변형(mutable), 시퀀스, [ ], 중복 허용, 가장 유용한 자료형

In [17]:
import pandas as pd

market_list = pd.DataFrame([[1, 'apple', 5000, 5],
                          [2, 'pencil', 500, 24],
                          [3,'pineapple',8000,5],
                          [4,'pen',1500,10],
                          [5,'mango',3000,15]],
                          columns=['id','name','price','amount'])

In [18]:
market_list

   id       name  price  amount
0   1      apple   5000       5
1   2     pencil    500      24
2   3  pineapple   8000       5
3   4        pen   1500      10
4   5      mango   3000      15

# 사전(dict) : 가변형(mutable), 순서가 없음, 연관형, {}
## {key : value} -> {아이디 : 패스워드}
## key는 반드시 불가변형(immutable)
## value는 가변 또는 불가변형 모두 가능

In [19]:
market_dict = pd.DataFrame({
    'ID' : [1,2,3,4,5],
    'NAME' : ['apple', 'pencil', 'pineapple', 'pen', 'mango'],
    'PRICE' : [5000, 500, 8000, 1500, 3000],
    'AMOUNT' : [5, 24, 5, 10,15]
})

In [20]:
market_dict

   ID       NAME  PRICE  AMOUNT
0   1      apple   5000       5
1   2     pencil    500      24
2   3  pineapple   8000       5
3   4        pen   1500      10
4   5      mango   3000      15

In [21]:
df2 = market_dict.copy()

In [22]:
df2

   ID       NAME  PRICE  AMOUNT
0   1      apple   5000       5
1   2     pencil    500      24
2   3  pineapple   8000       5
3   4        pen   1500      10
4   5      mango   3000      15

In [23]:
df2.head(2)

   ID    NAME  PRICE  AMOUNT
0   1   apple   5000       5
1   2  pencil    500      24

In [24]:
df2.tail(3)

   ID       NAME  PRICE  AMOUNT
2   3  pineapple   8000       5
3   4        pen   1500      10
4   5      mango   3000      15

In [25]:
df2.drop('ID',axis=1, inplace=True)

In [26]:
df2

        NAME  PRICE  AMOUNT
0      apple   5000       5
1     pencil    500      24
2  pineapple   8000       5
3        pen   1500      10
4      mango   3000      15

# 필터링 : 조건 검색

In [27]:
df2[df2.NAME == 'pen' ]

  NAME  PRICE  AMOUNT
3  pen   1500      10

In [28]:
df2[df2.PRICE >= 2000]

        NAME  PRICE  AMOUNT
0      apple   5000       5
2  pineapple   8000       5
4      mango   3000      15

In [29]:
df2[(df2.PRICE>=2000) & (df2.AMOUNT < 10)]

        NAME  PRICE  AMOUNT
0      apple   5000       5
2  pineapple   8000       5

## 비교연산자
### > : 크다 (초과)
### >= : 크거나 같다 (이상)
### < : 작다 (미만)
### <= : 작거나 같다 (이하)
### == : 같다
### != : 같지 않다.

### 논리 연산자
##### AND (&) : 교집합
##### OR (|) : 합집합
##### NOT  : 여집합

## 인덱싱과 슬라이싱
### 행 선택 : loc, iloc
### loc[  ] : 인덱스(행(숫자 또는 문자)) 기준
### iloc[  ] : 행번호(시스템) 기준

In [30]:
print(df2.loc[:]) # 전체 행 추출
print('\n')
print(df2.loc[0]) # 첫 번째 레코드 추출
print('\n')
print(df2.loc[[1,3]])# pencil과 pen행만 추출
print('\n')
print(df2.loc[1:3]) # 1~3행 레코드 추출
print('\n')
print(df2.loc[1:3,['PRICE','AMOUNT']]) # 행과 열을 동시에 추출
print('\n')
print(df2.loc[0,'NAME'])
print(df2.at[0,'NAME'])

        NAME  PRICE  AMOUNT
0      apple   5000       5
1     pencil    500      24
2  pineapple   8000       5
3        pen   1500      10
4      mango   3000      15


NAME      apple
PRICE      5000
AMOUNT        5
Name: 0, dtype: object


     NAME  PRICE  AMOUNT
1  pencil    500      24
3     pen   1500      10


        NAME  PRICE  AMOUNT
1     pencil    500      24
2  pineapple   8000       5
3        pen   1500      10


   PRICE  AMOUNT
1    500      24
2   8000       5
3   1500      10


apple
apple

In [31]:
print(df2.iloc[:]) # 전체 레코드 추출
print('\n')
print(df2.iloc[0]) # 첫 번째 레코드 추출
print('\n')
print(df2.iloc[-1]) # 마지막 레코드 추출
print('\n')
print(df2.iloc[1:3]) # 1~2 레코드 추출
print('\n')
print(df2.iloc[1:3,1:3])
print('\n')
print(df2.iloc[0,0])
print(df2.iat[0,0])

        NAME  PRICE  AMOUNT
0      apple   5000       5
1     pencil    500      24
2  pineapple   8000       5
3        pen   1500      10
4      mango   3000      15


NAME      apple
PRICE      5000
AMOUNT        5
Name: 0, dtype: object


NAME      mango
PRICE      3000
AMOUNT       15
Name: 4, dtype: object


        NAME  PRICE  AMOUNT
1     pencil    500      24
2  pineapple   8000       5


   PRICE  AMOUNT
1    500      24
2   8000       5


apple
apple

In [32]:
# 파생 변수 만들기

df1

        name  price  amount
0      apple   5000       5
1     pencil    500      24
2  pineapple   8000       5
3        pen   1500      10
4      mango   3000      15

In [33]:
df1['total']=df1['price'] * df1['amount']

In [34]:
df1

        name  price  amount  total
0      apple   5000       5  25000
1     pencil    500      24  12000
2  pineapple   8000       5  40000
3        pen   1500      10  15000
4      mango   3000      15  45000

In [35]:
df1.dtypes

name      object
price      int64
amount     int64
total      int64
dtype: object

In [36]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
name      5 non-null object
price     5 non-null int64
amount    5 non-null int64
total     5 non-null int64
dtypes: int64(3), object(1)
memory usage: 288.0+ bytes

In [37]:
type(df1.total)

pandas.core.series.Series

In [38]:
df1.count()# NaN 포함하지 않는 데이터 개수

name      5
price     5
amount    5
total     5
dtype: int64

In [39]:
len(df1)

5

In [40]:
df1.size # NaN 포함한 데이터 개수

20

In [41]:
df1.sum()

name      applepencilpineapplepenmango
price                            18000
amount                              59
total                           137000
dtype: object

In [42]:
df1.sum(axis=0)

name      applepencilpineapplepenmango
price                            18000
amount                              59
total                           137000
dtype: object

In [43]:
df1.sum(axis=1)

0    30005
1    12524
2    48005
3    16510
4    48015
dtype: int64

In [44]:
df1.isnull()

    name  price  amount  total
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False

In [45]:
df1.isnull().sum()

name      0
price     0
amount    0
total     0
dtype: int64

In [46]:
df1.index

RangeIndex(start=0, stop=5, step=1)

In [47]:
df1.columns

Index(['name', 'price', 'amount', 'total'], dtype='object')

In [48]:
b=df1.values
b

array([['apple', 5000, 5, 25000],
       ['pencil', 500, 24, 12000],
       ['pineapple', 8000, 5, 40000],
       ['pen', 1500, 10, 15000],
       ['mango', 3000, 15, 45000]], dtype=object)

In [49]:
type(b)

numpy.ndarray

In [50]:
b = df1.to_numpy()
b

array([['apple', 5000, 5, 25000],
       ['pencil', 500, 24, 12000],
       ['pineapple', 8000, 5, 40000],
       ['pen', 1500, 10, 15000],
       ['mango', 3000, 15, 45000]], dtype=object)

In [51]:
# 배열의 형태로 데이터 프레임 만들기

import numpy as np
import pandas as pd
c = pd.DataFrame(np.arange(1,17).reshape(4,4), columns=['A','B','C','D'])
c

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [52]:
c.loc[0:2]

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [53]:
c.iloc[0:3]

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [54]:
df1.sort_values(by=['name'], axis=0)

        name  price  amount  total
0      apple   5000       5  25000
4      mango   3000      15  45000
3        pen   1500      10  15000
1     pencil    500      24  12000
2  pineapple   8000       5  40000

In [55]:
df1.sort_values(by=['total'], ascending=False)

        name  price  amount  total
4      mango   3000      15  45000
2  pineapple   8000       5  40000
0      apple   5000       5  25000
3        pen   1500      10  15000
1     pencil    500      24  12000

In [56]:
df1.sort_values(by=['amount','name'])

        name  price  amount  total
0      apple   5000       5  25000
2  pineapple   8000       5  40000
3        pen   1500      10  15000
4      mango   3000      15  45000
1     pencil    500      24  12000

In [57]:
df1_t=df1.T

In [58]:
df1_t

            0       1          2      3      4
name    apple  pencil  pineapple    pen  mango
price    5000     500       8000   1500   3000
amount      5      24          5     10     15
total   25000   12000      40000  15000  45000

In [59]:
df1_t.loc['score']=[5, 4, 3, 2,1]
df1_t

            0       1          2      3      4
name    apple  pencil  pineapple    pen  mango
price    5000     500       8000   1500   3000
amount      5      24          5     10     15
total   25000   12000      40000  15000  45000
score       5       4          3      2      1

In [60]:
df1_t['5'] = ['note', 1000, 7, 7000, 3]
df1_t

            0       1          2      3      4     5
name    apple  pencil  pineapple    pen  mango  note
price    5000     500       8000   1500   3000  1000
amount      5      24          5     10     15     7
total   25000   12000      40000  15000  45000  7000
score       5       4          3      2      1     3

# 6.데이터프레임 합성

# 두 개 이상의 데이터 프레임을 하나로 합치는 방법
## 데이터 병합(merge)
## 데이터 연결(concatenate)

In [61]:
import numpy as np
import pandas as pd

In [62]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름' : ['둘리','도우너','또치','길동','희동','마이콜','영희']
}, columns = ['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [63]:
df2 = pd.DataFrame({
  '고객번호' : [1001, 1001, 1005, 1006, 1008, 1001],
    '금액' : [10000, 20000, 15000, 5000, 10000, 30000]
}, columns=['고객번호','금액'])
df2

   고객번호     금액
0  1001  10000
1  1001  20000
2  1005  15000
3  1006   5000
4  1008  10000
5  1001  30000

In [64]:
pd.merge(df1, df2) # inner join

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [65]:
pd.merge(df1, df2, how='outer') # 외부조인

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN
9  1008  NaN  10000.0

In [66]:
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [67]:
pd.merge(df1, df2, how='right')

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000
5  1008  NaN  10000

# concat()함수

### 기준 열(key column)을 사용하지 않고 단순히 데이터를 연결
### 기본적으로 위/아래 데이터를 행으로 연결
### 단순히 두 시리즈나 데이터 프레임을 연결하기 때문에 인덱스 값이 중복가능

In [68]:
s1 = pd.Series([0,1], index=['A','B'])
s2 = pd.Series([2,3,4], index =['A','B','C'])

In [69]:
s1

A    0
B    1
dtype: int64

In [70]:
s2

A    2
B    3
C    4
dtype: int64

In [71]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [72]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                  index=['a','b','c'],
                  columns =['data1','data2'])

In [73]:
df2 = pd.DataFrame( 5 + np.arange(4).reshape(2,2),
                  index=['a','b'],
                  columns =['data3','data4'])

In [74]:
pd.concat([df1, df2],axis=1, sort=True)

   data1  data2  data3  data4
a      0      1    5.0    6.0
b      2      3    7.0    8.0
c      4      5    NaN    NaN

In [75]:
pd.concat([df1, df2], axis=0, sort=False)

   data1  data2  data3  data4
a    0.0    1.0    NaN    NaN
b    2.0    3.0    NaN    NaN
c    4.0    5.0    NaN    NaN
a    NaN    NaN    5.0    6.0
b    NaN    NaN    7.0    8.0

### 피벗테이블 : 데이터 열 중에서 두 개의 열을 각각 행과 열로 사용하여 교차테이블을 만듦

### df.pivot(행으로 사용할 열 이름, 열로 사용할 열 이름, 데이터로 사용할 열 이름)

In [76]:
data = {

'도시' : ['서울','서울','서울','부산','부산','부산','인천','인천'],

'연도' : ['2015','2010','2005','2015','2010','2005','2015','2010'],

'인구' : [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],

'지역' : ['수도권','수도권','수도권','경상권','경상권','경상권','수도권','수도권']

}

columns = ['도시','연도','인구','지역']

df1 = pd.DataFrame(data, columns=columns)

df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [77]:
df1.pivot('도시','연도','인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

In [78]:
df1.set_index(['도시','연도'])[['인구']]

              인구
도시 연도
서울 2015  9904312
   2010  9631482
   2005  9762546
부산 2015  3448737
   2010  3393191
   2005  3512547
인천 2015  2890451
   2010   263203

In [81]:
df1.set_index(['지역','도시'],'연도','인구')

            연도       인구
  지역  도시
0 수도권 서울  2015  9904312
1 수도권 서울  2010  9631482
2 수도권 서울  2005  9762546
3 경상권 부산  2015  3448737
4 경상권 부산  2010  3393191
5 경상권 부산  2005  3512547
6 수도권 인천  2015  2890451
7 수도권 인천  2010   263203

In [ ]:
pip upgrade --user pandas